УТ.ГрафиБотГрафическийКонструкторТелеграмБотов/src/Catalogs/гбХранилищаБлокСхем/гбХранилищаБлокСхем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гбХранилищаБлокСхем</name>
  <attributes>
    <name>АдресПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ.ГрафиБотГрафическийКонструкторТелеграмБотов/src/Catalogs/гбХранилищаБлокСхем/Forms/АдминистрированиеПользователей/Module.bsl
&НаКлиенте
Процедура ПользователиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекущиеДанные = Пользователи.НайтиПоИдентификатору(Элементы.Пользователи.ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Хранилище", Хранилище);
	ПараметрыФормы.Вставить("ИмяПользователя", ТекущиеДанные.ИмяПользователя);
	ПараметрыФормы.Вставить("Администрирование", ТекущиеДанные.Администрирование);
	ПараметрыФормы.Вставить("ЗахватОбъектов", ТекущиеДанные.ЗахватОбъектов);
	ОткрытьФорму("Справочник.гбХранилищаБлокСхем.Форма.ИзменитьПользователя", ПараметрыФормы,,,,,
	    Новый ОписаниеОповещения("ПослеИзмененияПользователя", ЭтаФорма));
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСписок(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПользователиПередУдалениемНаСервере()
	ХранилищеОбъект = Хранилище.ПолучитьОбъект();
	
	ТекущиеДанные = Пользователи.НайтиПоИдентификатору(Элементы.Пользователи.ТекущаяСтрока);
	
	гбХранилище.ВыполнитьУдаленно(ХранилищеОбъект, "ИзменитьПользователя", 
		ХранилищеОбъект.ИмяПользователя, ХранилищеОбъект.Пароль,
		ТекущиеДанные.ИмяПользователя, , , , , Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	Попытка

		ПользователиПередУдалениемНаСервере();
		ОбновитьСписок(Неопределено);
		
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПользователиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Хранилище", Хранилище);
	ОткрытьФорму("Справочник.гбХранилищаБлокСхем.Форма.ИзменитьПользователя", ПараметрыФормы,,,,,
	    Новый ОписаниеОповещения("ПослеИзмененияПользователя", ЭтаФорма));
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияПользователя(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено тогда
		Возврат;
	КонецЕсли;

	ОбновитьСписок(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	ХранилищеОбъект = Хранилище.ПолучитьОбъект();
	ТекИмяПользователя = ХранилищеОбъект.ИмяПользователя;
	Список = гбХранилище.ВыполнитьУдаленно(ХранилищеОбъект, "СписокПользователей", 
			ХранилищеОбъект.ИмяПользователя, ХранилищеОбъект.Пароль);
			
	Пользователи.Очистить();
	Для Каждого ЭлементСписка из Список Цикл
		НоваяСтрока = Пользователи.Добавить();
		НоваяСтрока.ИмяПользователя = ЭлементСписка.Представление;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементСписка.Значение);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Хранилище = Параметры.Хранилище;
КонецПроцедуры
